import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        System.out.println("    Билет №1");
//        Билет №1.
//       1. Дайте определение переменной. Перечислите типы переменных и хранимые в них данные.//
//       2.Методы каких типов бывают? Приведите примеры использования каждого типа.//
//       3.Какие методы называются геттерами? Что они делают?

//        - Задача
//    Напишите программу, которая переворачивает массив.


    }
}




